STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_RCP/STM32_WPAN/App/app_thread.c
  /* Notify M0 that characters have been sent to UART */
  TL_THREAD_CliSendAck();
}

/**
 * @brief Perform initialization of CLI UART interface.
 * @param  None
 * @retval None
 */
void APP_THREAD_Init_UART_CLI(void)
{
#if (CFG_FULL_LOW_POWER == 0)
  UTIL_SEQ_RegTask( 1<<CFG_TASK_SEND_CLI_TO_M0, UTIL_SEQ_RFU,Send_CLI_To_M0);
#endif /* (CFG_FULL_LOW_POWER == 0) */

#if (CFG_USB_INTERFACE_ENABLE != 0)
#else
#if (CFG_FULL_LOW_POWER == 0)
#ifdef OPENTHREAD_RCP
  MX_LPUART1_UART_Init();
#else
  MX_USART1_UART_Init();
#endif

  HW_UART_Receive_IT(CFG_CLI_UART, aRxBuffer, 1, RxCpltCallback);
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */
}

/**
 * @brief Perform initialization of TL for THREAD.
 * @param  None
 * @retval None
 */
void APP_THREAD_TL_THREAD_INIT(void)
{
  ThreadConfigBuffer.p_ThreadOtCmdRspBuffer = (uint8_t*)&ThreadOtCmdBuffer;
  ThreadConfigBuffer.p_ThreadNotAckBuffer = (uint8_t*)ThreadNotifRspEvtBuffer;
  ThreadConfigBuffer.p_ThreadCliRspBuffer = (uint8_t*)&ThreadCliCmdBuffer;

  TL_THREAD_Init( &ThreadConfigBuffer );
}

/**
 * @brief  This function is called when notification on CLI TL Channel from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_THREAD_CliNotReceived( TL_EvtPacket_t * Notbuffer )
{
  TL_CmdPacket_t* l_CliBuffer = (TL_CmdPacket_t*)Notbuffer;
  uint8_t l_size = l_CliBuffer->cmdserial.cmd.plen;

#ifdef OPENTHREAD_RCP
  if (l_size) {
	  HW_UART_Transmit_IT(CFG_CLI_UART, l_CliBuffer->cmdserial.cmd.payload, l_size, HostTxCb);
  }
  Send_CLI_Ack_For_OT();

#else
  /* WORKAROUND: if string to output is "> " then respond directly to M0 and do not output it */
  if (strcmp((const char *)l_CliBuffer->cmdserial.cmd.payload, "> ") != 0)
  {
    /* Write to CLI UART */
#if (CFG_USB_INTERFACE_ENABLE != 0)
    VCP_SendData( l_CliBuffer->cmdserial.cmd.payload, l_size, HostTxCb);
#else
    HW_UART_Transmit_IT(CFG_CLI_UART, l_CliBuffer->cmdserial.cmd.payload, l_size, HostTxCb);
#endif /*USAGE_OF_VCP */
  }
  else
  {
    Send_CLI_Ack_For_OT();
  }
#endif
}

/**
 * @brief  End of transfer callback for CLI UART sending.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void HostTxCb(void)
{
#ifdef OPENTHREAD_RCP
	return;
#else
  Send_CLI_Ack_For_OT();
#endif
}

/**
 * @brief Process the messages coming from the M0.
 * @param  None
 * @retval None
 */
void APP_THREAD_ProcessMsgM0ToM4(void)
{
  if (CptReceiveMsgFromM0 != 0)
  {
    /* If CptReceiveMsgFromM0 is > 1. it means that we did not serve all the events from the radio */
    if (CptReceiveMsgFromM0 > 1U)
    {
      APP_THREAD_Error(ERR_REC_MULTI_MSG_FROM_M0, 0);
    }
    else
    {
#ifdef OPENTHREAD_RCP
      RCP_PacketFromM0_Processing();
#else
      OpenThread_CallBack_Processing();
#endif
    }
    /* Reset counter */
    CptReceiveMsgFromM0 = 0;
  }
}

// RCP Packet received from M0, send it to OT Host thru LPUART
void RCP_PacketFromM0_Processing() {


	/* Get pointer on received RCP Packet buffer from M0 */
	RCP_Packet_t* p_RCPPacket = THREAD_Get_RCPPayloadBuffer();

	// Check if we reveived a M0 RCP Command or a RCP M0 Packet
	if (p_RCPPacket->RCP_packetLength == 1) {
		// We have a Command, as HDLC framing implies at list 5 byyes
		switch (p_RCPPacket->RCP_packetPayload[0]) {
		  case 'R' :
			  APP_DBG("[M4 SPINEL] : Received a Reset Command from M0...");
			  /* Perform an NVIC Reset in order to reinitialize the device */
			  HAL_NVIC_SystemReset();
			  break;
                default:
		  	  APP_DBG("[M4 SPINEL] : Received an UNKNOWN Command from M0 !!");
		      break;
		}
	}

#if !HDLC_FRAMING_CHECK
	// Just send received buffer on UART without checking HDLC framing
	HW_UART_Transmit_IT(CFG_CLI_UART, p_RCPPacket->RCP_packetPayload, p_RCPPacket->RCP_packetLength, TL_THREAD_SendAck);
	APP_DBG("<-M4(%d)\n\r", p_RCPPacket->RCP_packetLength);
#else
	// First copy received HDLC frame at its right place
	if (HdlcFrameCounter < HDLC_MAX_APPENDED_FRAME_NUMBER)
	{
		memcpy(HdlcAppendBuffer+(HdlcFrameCounter*128), p_RCPPacket->RCP_packetPayload, p_RCPPacket->RCP_packetLength);
		HdlcAppendBufferLength += p_RCPPacket->RCP_packetLength;

		if (p_RCPPacket->RCP_packetLength == 128) {
			// In that case, whether we have a well formatted HDLC frame of 128 bytes, so ending with a 0x7E,
			// or we are in the middle os a HDLC frame and we need to append it with the coming buffer...
			// buffer is coming...
			if (p_RCPPacket->RCP_packetPayload[127] == 0x7E) {
				APP_DBG("[M4 SPINEL] : HDLC frame is 128 sharp !!");
				HdlcFrameReadyToBeSent = TRUE;
				// Nothing more to do here, just send it over uart interface...
			}
			else {
				// Need to append to save part of HDLC frame into a buffer
				HdlcFrameCounter++;
				HdlcFrameReadyToBeSent = FALSE;
				APP_DBG("%d-M4 ", HdlcFrameCounter);
			}
		} else
		{
			HdlcFrameReadyToBeSent = TRUE;
		}

		// Send to LPUART
		if (HdlcAppendBufferLength && HdlcFrameReadyToBeSent)
		{
			APP_DBG("<-M4\n\r");
			HW_UART_Transmit_IT(CFG_CLI_UART, HdlcAppendBuffer, HdlcAppendBufferLength, /*HostTxCb*/TL_THREAD_SendAck);
			HdlcFrameCounter = 0;
			HdlcAppendBufferLength = 0;
		} else {
			// bytes copied into HdlcAppendBuffer, ready to receive more...
			TL_THREAD_SendAck();
		}

	} else  {
		APP_DBG("[M4 SPINEL] : Warning Max number of HDLC frames reached ! %d", HdlcFrameCounter);
		HdlcFrameCounter = 0;
	    HdlcAppendBufferLength = 0;
	    HdlcFrameReadyToBeSent = TRUE;
	}
#endif

}

#if (CFG_USB_INTERFACE_ENABLE != 0)
/**
 * @brief  This function is called when thereare some data coming
 *         from the Hyperterminal via the USB port
 *         Data received over USB OUT endpoint are sent over CDC interface
 *         through this function.
 * @param  Buf: Buffer of data received
 * @param  Len: Number of data received (in bytes)
 * @retval Number of characters remaining in the buffer and not yet processed
 */
void VCP_DataReceived(uint8_t* Buf , uint32_t *Len)
{
  uint32_t i,flag_continue_checking = TRUE;
  uint32_t char_remaining = 0;
  static uint32_t len_total = 0;

  /* Copy the characters in the temporary buffer */
  for (i = 0; i < *Len; i++)
  {
    TmpString[len_total++] = Buf[i];
  }

  /* Process the buffer commands one by one     */
  /* A command is limited by a \r caracaters    */
  while (flag_continue_checking == TRUE)
  {
    char_remaining = ProcessCmdString(TmpString,len_total);
    /* If char_remaining is equal to len_total, it means that the command string is not yet
     * completed.
     * If char_remaining is equal to 0, it means that the command string has
     * been entirely processed.
     */
    if ((char_remaining == 0) || (char_remaining == len_total))
    {
      flag_continue_checking = FALSE;
    }
    len_total = char_remaining;
  }
}
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
